Evaluation/session_access_load-test-local.yml
config:
  target: "http://localhost:8080" # Replace with your API's base URL
  phases:
    - duration: 1 # Phase duration in seconds
      arrivalRate: 10 # Starting arrival rate (new users per second)
      rampTo: 300 # Target arrival rate at the end of the phase
      name: "Ramp-up phase"
    payload:
    path: 'bodies.csv'
    fields:
      - 'session_id'
    order: sequence
scenarios:
  - flow:
      - get:
          url: "/session/create{{ sessiond_id }}" # Replace with your API endpoint
          timeout: 60000 # timeout in milliseconds (60 seconds)